<a href="https://colab.research.google.com/github/robsonbfreitas/TrabalhoFinal/blob/main/TrabalhoFinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#Importando bibliotecas
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score

In [4]:
df = pd.read_csv('features.csv')
#dftest = pd.read_csv('test.csv')
dftrain = pd.read_csv('train.csv')
df.head()

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  2010-02-05        42.31  ...  211.096358         8.106      False
1      1  2010-02-12        38.51  ...  211.242170         8.106       True
2      1  2010-02-19        39.93  ...  211.289143         8.106      False
3      1  2010-02-26        46.63  ...  211.319643         8.106      False
4      1  2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [5]:
dftrain.head(30)

    Store  Dept        Date  Weekly_Sales IsHoliday
0       1     1  2010-02-05      24924.50     False
1       1     1  2010-02-12      46039.49      True
2       1     1  2010-02-19      41595.55     False
3       1     1  2010-02-26      19403.54     False
4       1     1  2010-03-05      21827.90     False
5       1     1  2010-03-12      21043.39     False
6       1     1  2010-03-19      22136.64     False
7       1     1  2010-03-26      26229.21     False
8       1     1  2010-04-02      57258.43     False
9       1     1  2010-04-09      42960.91     False
10      1     1  2010-04-16      17596.96     False
11      1     1  2010-04-23      16145.35     False
12      1     1  2010-04-30      16555.11     False
13      1     1  2010-05-07      17413.94     False
14      1     1  2010-05-14      18926.74     False
15      1     1  2010-05-21      14773.04     False
16      1     1  2010-05-28      15580.43     False
17      1     1  2010-06-04      17558.09     False
18      1     1  2010-06-11      16637.62     False
19      1     1  2010-06-18      16216.27     False
20      1     1  2010-06-25      16328.72     False
21      1     1  2010-07-02      16333.14     False
22      1     1  2010-07-09      17688.76     False
23      1     1  2010-07-16      17150.84     False
24      1     1  2010-07-23      15360.45     False
25      1     1  2010-07-30      15381.82     False
26      1     1  2010-08-06      17508.41     False
27      1     1  2010-08-13      15536.40     False
28      1     1  2010-08-20      15740.13     False
29      1     1  2010-08-27      15793.87     False

In [7]:
frames = [df, dftrain]
df2 = dftrain.merge(df, on=['Store','Date'], how='left')

In [8]:
df2.head()

   Store  Dept        Date  ...         CPI Unemployment  IsHoliday_y
0      1     1  2010-02-05  ...  211.096358        8.106        False
1      1     1  2010-02-12  ...  211.242170        8.106         True
2      1     1  2010-02-19  ...  211.289143        8.106        False
3      1     1  2010-02-26  ...  211.319643        8.106        False
4      1     1  2010-03-05  ...  211.350143        8.106        False

[5 rows x 15 columns]

In [9]:
df.query('Date == "2010-02-12"').query('Store == 1')

   Store        Date  Temperature  ...        CPI  Unemployment  IsHoliday
1      1  2010-02-12        38.51  ...  211.24217         8.106       True

[1 rows x 12 columns]

In [10]:
dftrain.query('Date == "2010-02-12"').query('Store == 1')

       Store  Dept        Date  Weekly_Sales IsHoliday
1          1     1  2010-02-12      46039.49      True
144        1     2  2010-02-12      44682.74      True
287        1     3  2010-02-12      10887.84      True
430        1     4  2010-02-12      35351.21      True
573        1     5  2010-02-12      29620.81      True
...      ...   ...         ...           ...       ...
9371       1    93  2010-02-12      70202.02      True
9514       1    94  2010-02-12      62329.48      True
9657       1    95  2010-02-12     111390.36      True
9922       1    97  2010-02-12      33874.47      True
10065      1    98  2010-02-12      16309.73      True

[72 rows x 5 columns]

In [11]:
df2.query('Date == "2010-02-12"').query('Store == 1')

       Store  Dept        Date  ...        CPI Unemployment  IsHoliday_y
1          1     1  2010-02-12  ...  211.24217        8.106         True
144        1     2  2010-02-12  ...  211.24217        8.106         True
287        1     3  2010-02-12  ...  211.24217        8.106         True
430        1     4  2010-02-12  ...  211.24217        8.106         True
573        1     5  2010-02-12  ...  211.24217        8.106         True
...      ...   ...         ...  ...        ...          ...          ...
9371       1    93  2010-02-12  ...  211.24217        8.106         True
9514       1    94  2010-02-12  ...  211.24217        8.106         True
9657       1    95  2010-02-12  ...  211.24217        8.106         True
9922       1    97  2010-02-12  ...  211.24217        8.106         True
10065      1    98  2010-02-12  ...  211.24217        8.106         True

[72 rows x 15 columns]

In [12]:
df2.tail(10)

        Store  Dept        Date  ...         CPI Unemployment  IsHoliday_y
105197     11    71  2011-06-24  ...  218.450940        7.574        False
105198     11    71  2011-07-01  ...  218.546705        7.567        False
105199     11    71  2011-07-08  ...  218.642470        7.567        False
105200     11    71  2011-07-15  ...  218.727522        7.567        False
105201     11    71  2011-07-22  ...  218.785788        7.567        False
105202     11    71  2011-07-29  ...  218.844054        7.567        False
105203     11    71  2011-08-05  ...  218.902321        7.567        False
105204     11    71  2011-08-12  ...  218.960587        7.567        False
105205     11    71  2011-08-19  ...  219.023271        7.567        False
105206     11    71  2011-08-26  ...  219.086691        7.567        False

[10 rows x 15 columns]

In [36]:
df3 = df2[['Store','Date','IsHoliday_y', 'Dept', 'Weekly_Sales','MarkDown1','MarkDown2','MarkDown3','MarkDown4','MarkDown5']]
df3.head()

   Store        Date  IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
0      1  2010-02-05        False  ...        NaN        NaN        NaN
1      1  2010-02-12         True  ...        NaN        NaN        NaN
2      1  2010-02-19        False  ...        NaN        NaN        NaN
3      1  2010-02-26        False  ...        NaN        NaN        NaN
4      1  2010-03-05        False  ...        NaN        NaN        NaN

[5 rows x 10 columns]

In [37]:
df3.query('MarkDown5 != "NaN"')

        Store        Date  IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
92          1  2011-11-11        False  ...     215.07    2406.62    6551.42
93          1  2011-11-18        False  ...      51.98     427.39    5988.57
94          1  2011-11-25         True  ...   55805.51       8.00     554.92
95          1  2011-12-02        False  ...    1398.11    2084.64   20475.32
96          1  2011-12-09        False  ...     105.02    3639.42   14461.82
...       ...         ...          ...  ...        ...        ...        ...
105120     11  2012-09-28        False  ...       5.20    1653.38    3211.84
105121     11  2012-10-05        False  ...      27.94    1754.56    5473.90
105122     11  2012-10-12        False  ...      22.95     271.93   13035.68
105123     11  2012-10-19        False  ...     153.97     409.53    2739.63
105124     11  2012-10-26        False  ...     153.00    1060.90    3936.20

[37628 rows x 10 columns]

In [38]:
df3['Date'] = pd.to_datetime(df3['Date'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [39]:
df3.set_index(['Date'], inplace=True)

In [40]:
df3.head()

            Store  IsHoliday_y  Dept  ...  MarkDown3  MarkDown4  MarkDown5
Date                                  ...
2010-02-05      1        False     1  ...        NaN        NaN        NaN
2010-02-12      1         True     1  ...        NaN        NaN        NaN
2010-02-19      1        False     1  ...        NaN        NaN        NaN
2010-02-26      1        False     1  ...        NaN        NaN        NaN
2010-03-05      1        False     1  ...        NaN        NaN        NaN

[5 rows x 9 columns]

In [41]:
df3.fillna(0, inplace=True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4327: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [42]:
df3.head(100)

            Store  IsHoliday_y  Dept  ...  MarkDown3  MarkDown4  MarkDown5
Date                                  ...
2010-02-05      1        False     1  ...       0.00       0.00       0.00
2010-02-12      1         True     1  ...       0.00       0.00       0.00
2010-02-19      1        False     1  ...       0.00       0.00       0.00
2010-02-26      1        False     1  ...       0.00       0.00       0.00
2010-03-05      1        False     1  ...       0.00       0.00       0.00
...           ...          ...   ...  ...        ...        ...        ...
2011-12-02      1        False     1  ...    1398.11    2084.64   20475.32
2011-12-09      1        False     1  ...     105.02    3639.42   14461.82
2011-12-16      1        False     1  ...     347.37     225.79    4011.37
2011-12-23      1        False     1  ...     634.70      24.90    2739.43
2011-12-30      1         True     1  ...     260.36     983.65    4735.78

[100 rows x 9 columns]

In [43]:
y = df3[['Weekly_Sales']]
y

            Weekly_Sales
Date
2010-02-05      24924.50
2010-02-12      46039.49
2010-02-19      41595.55
2010-02-26      19403.54
2010-03-05      21827.90
...                  ...
2011-07-29      10299.57
2011-08-05      10133.66
2011-08-12       9871.59
2011-08-19      11545.97
2011-08-26       8865.91

[105207 rows x 1 columns]

In [44]:
y = y.iloc[1:]
y.head()

            Weekly_Sales
Date
2010-02-12      46039.49
2010-02-19      41595.55
2010-02-26      19403.54
2010-03-05      21827.90
2010-03-12      21043.39

In [45]:
X = df3[['Store','Dept','IsHoliday_y','Weekly_Sales','MarkDown1','MarkDown2','MarkDown3','MarkDown4','MarkDown5']].shift(1)
#X = df.shift(1)
X

            Store  Dept IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
Date                                 ...
2010-02-05    NaN   NaN         NaN  ...        NaN        NaN        NaN
2010-02-12    1.0   1.0       False  ...        0.0        0.0        0.0
2010-02-19    1.0   1.0        True  ...        0.0        0.0        0.0
2010-02-26    1.0   1.0       False  ...        0.0        0.0        0.0
2010-03-05    1.0   1.0       False  ...        0.0        0.0        0.0
...           ...   ...         ...  ...        ...        ...        ...
2011-07-29   11.0  71.0       False  ...        0.0        0.0        0.0
2011-08-05   11.0  71.0       False  ...        0.0        0.0        0.0
2011-08-12   11.0  71.0       False  ...        0.0        0.0        0.0
2011-08-19   11.0  71.0       False  ...        0.0        0.0        0.0
2011-08-26   11.0  71.0       False  ...        0.0        0.0        0.0

[105207 rows x 9 columns]

In [46]:
X = X.iloc[1:]
X.head()

            Store  Dept IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
Date                                 ...
2010-02-12    1.0   1.0       False  ...        0.0        0.0        0.0
2010-02-19    1.0   1.0        True  ...        0.0        0.0        0.0
2010-02-26    1.0   1.0       False  ...        0.0        0.0        0.0
2010-03-05    1.0   1.0       False  ...        0.0        0.0        0.0
2010-03-12    1.0   1.0       False  ...        0.0        0.0        0.0

[5 rows x 9 columns]

In [47]:
y.shape, X.shape

((105206, 1), (105206, 9))

In [48]:
X = pd.get_dummies(X)
X.head()

            Store  Dept  ...  IsHoliday_y_False  IsHoliday_y_True
Date                     ...
2010-02-12    1.0   1.0  ...                  1                 0
2010-02-19    1.0   1.0  ...                  0                 1
2010-02-26    1.0   1.0  ...                  1                 0
2010-03-05    1.0   1.0  ...                  1                 0
2010-03-12    1.0   1.0  ...                  1                 0

[5 rows x 10 columns]

In [49]:
X.isna().mean()

Store                0.0
Dept                 0.0
Weekly_Sales         0.0
MarkDown1            0.0
MarkDown2            0.0
MarkDown3            0.0
MarkDown4            0.0
MarkDown5            0.0
IsHoliday_y_False    0.0
IsHoliday_y_True     0.0
dtype: float64

In [50]:
reg = LinearRegression()
reg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [51]:
X.shape

(105206, 10)

In [52]:
y.shape

(105206, 1)

In [53]:
result = reg.predict(X)

In [54]:
result

array([[24464.73307783],
       [43737.98987878],
       [40325.8329508 ],
       ...,
       [10466.01313379],
       [10216.67560294],
       [11809.70713996]])

In [55]:
# Utilizando R2 para medir a performance do modelo
r2_score(y, result)

0.90678284662082